#include <iostream>
#include <stdio.h>
#include <assert.h>
#include "tasks.h"

int main() {

    // Номер 1
    task1(2);          // Степень записываем как аргумент

    // Номер 2
    task2(10);       // Число для вывода записываем как аргумент

    // Номер 3
    task3(10);     // Положительное число вводим как аргумент

    // Номер 4
    task4(10);       // Положительное число вводим как аргумент

    // Номер 5
    task5(9,1);      // n i

    // Номер 6
    task6(11,1);

    // Номер 7
    task7(5,1);

    // Номер 8
    task8(8);

    // Номер 9
    task9(247);

    // Номер 10
    task10(145,0,7);

    // Номер 11
    task11(11,2);

    return 0;
}